azps-tools.azps-tools
davidanson.vscode-markdownlint
docsmsft.docs-article-templates
docsmsft.docs-authoring-pack
docsmsft.docs-images
docsmsft.docs-markdown
docsmsft.docs-preview
docsmsft.docs-scaffolding
docsmsft.docs-yaml
github.copilot
github.copilot-chat
hashicorp.terraform
learningengineeringoperations.learn-training-ai-assistant
ms-azuretools.azure-dev
ms-azuretools.vscode-azure-github-copilot
ms-azuretools.vscode-azureresourcegroups
ms-azuretools.vscode-azureterraform
ms-azuretools.vscode-bicep
ms-dotnettools.vscode-dotnet-runtime
ms-vscode.azure-account
ms-vscode.azurecli
msazurermtools.azurerm-vscode-tools
redhat.vscode-yaml